In [1]:
li = [0,1,2,3,4,5,6,7,8,9]
type(li)

list

In [2]:
#calculate memory consumption
import sys
print("memory consumed by a single element in list",sys.getsizeof(li[0]))

memory consumed by a single element in list 24

In [3]:
print("Total memory Consumed by a element",len(li)*sys.getsizeof(li[0]))

Total memory Consumed by a element 240

In [10]:
import numpy as np
arr = np.array(li)
arr
type(arr)

numpy.ndarray

In [16]:
print("memory Consumption by single element in arr:", arr.itemsize)

memory Consumption by single element in arr: 8

In [17]:
print("Total memory Consumption by all element in arr:",arr.itemsize * arr.size)

Total memory Consumption by all element in arr: 80

In [18]:
a = [[1,2,3],[4,5,6],[7,8,9]]
type(a)

list

In [19]:
arr1 = np.array(a)
arr1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [20]:
arr1.ndim

2

In [21]:
# installation
#pip3 install pandas ------>in ubuntu
#pip install pandas ---------------> in windows
#sudo apt-get intall python3-pandas-------->in ubuntu terminal

In [22]:
import pandas as pd

In [29]:
df = pd.read_csv("/home/mathematics/Desktop/dataset/Iris.csv")

In [30]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df["Species"].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [34]:
#cheking mission values
df.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [35]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [54]:
df = pd.read_csv("/home/mathematics/Desktop/dataset/tips.csv")

In [48]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [55]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [56]:
df1 = pd.DataFrame()
print(df1)

Empty DataFrame
Columns: []
Index: []

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [2]:
import pandas as pd

df = pd.read_csv("/home/mathematics/Desktop/dataset/tips.csv")

In [4]:
tips["day"].unique()

NameError: name 'tips' is not defined

In [5]:
tips["time"].unique()

NameError: name 'tips' is not defined

In [6]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
df["day"].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [9]:
df["time"].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [10]:
#visulatisation
import seaborn as sns

In [12]:
#installation
#pip install seaborn --------->windows
#pip3 install seaborn -----------> ubuntu
#sudo apt-phthon2-seaborn-------> for ubuntu